org-contrib/babel/examples/foo.org.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.1//EN"
"http://www.w3.org/TR/xhtml11/DTD/xhtml11.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
  <head>
    <title>foo.org</title>
<meta name="generator" content="emacs 23.2.1; htmlfontify 0.21" />

  </head>
  <body onload="stripe('index'); return true;">

<pre><span class="org-document-info-keyword" id="nil-1">#+TITLE:</span><span class="org-document-title" id="nil-9"> An Org-mode Demo</span>
<span class="org-document-info-keyword" id="nil-27">#+AUTHOR:</span><span class="org-document-info" id="nil-36"> Eric Schulte</span>
<span class="org-meta-line" id="nil-50">#+OPTIONS: num:nil ^:nil f:nil</span>
<span class="org-meta-line" id="nil-81">#+LATEX_HEADER: \usepackage{amscd}</span>
<span class="org-meta-line" id="nil-116">#+STARTUP: hideblocks</span>
<span class="org-meta-line" id="nil-138">#+BABEL: :session </span><span class="org-meta-line" id="nil-156">*R</span><span class="org-meta-line" id="nil-158">*</span><span class="org-meta-line" id="nil-159"> </span><span class="org-meta-line" id="nil-160">:results silent</span>

<span class="comment" id="nil-177"># some minor customization for nicer looking LaTeX output</span>
<span class="org-meta-line" id="nil-235">#+begin_LaTeX
</span><span class="org-block" id="nil-249">  \hypersetup{
    linkcolor=blue,
    pdfborder={0 0 0 0}
  }
  \lstset{basicstyle=\ttfamily\bfseries\small}</span><span class="org-meta-line" id="nil-358">
#+end_LaTeX</span>

<span class="org-meta-line" id="nil-372">#+begin_center
</span>  Adapted from <span class="italic" id="nil-402">/</span><span onclick="toggle_invis('invisible-403-454');">…</span><span class="italic" id="invisible-403-454-403">[[http://www.stat.umn.edu/~charlie/Sweave/foo.Rnw]</span><span class="italic" id="invisible-403-454-453">[</span><span class="italic" id="nil-454">A</span><span class="italic" id="nil-455">n</span><span class="italic" id="nil-456"> Sweave Dem</span><span class="italic" id="nil-467">o</span><span onclick="toggle_invis('invisible-468-470');">…</span><span class="italic" id="invisible-468-470-468">]</span><span class="italic" id="invisible-468-470-469">]</span><span class="italic" id="nil-470">/</span> by Charles J. Geyer.<span class="org-meta-line" id="nil-492">
#+end_center</span>

This is a demo for using Org-babel to produce LaTeX documents with
embedded R code.  To get started fire up Emacs and create a text file
with the <span class="org-code" id="nil-653">=.org=</span> suffix.  You should see Org-mode become your major
mode -- denoted by <span class="org-code" id="nil-730">=Org=</span> in your status bar.

Press <span class="org-code" id="nil-763">=C-c C-e=</span> while viewing this Org-mode buffer and you will see a
menu appear with options for export to a variety target formats --
herein we'll only consider export to LaTeX.

So now we have a more complicated file chain
$$
\begin{CD}
   \texttt{foo.org}
   @&gt;\texttt{Sweave}&gt;&gt;
   \texttt{foo.tex}
   @&gt;\texttt{latex}&gt;&gt;
   \texttt{foo.dvi}
   @&gt;\texttt{xdvi}&gt;&gt;
   \text{view of document}
\end{CD}
$$
and what have we accomplished other than making it twice as annoying
as the WYSIWYG crows (having to use both <span class="org-code" id="nil-1273">=Org-mode=</span> and <span class="org-code" id="nil-1288">=latex=</span> to get
anything that looks like the document)?

Well, we can now include <span class="org-code" id="nil-1369">=R=</span> in our document.  Here's a simple example
<span class="org-meta-line" id="nil-1415">#+begin_src R :exports both
</span><span class="org-block" id="nil-1443">  2 + 2</span><span class="org-meta-line" id="nil-1450">
#+end_src</span>
What I actually typed in <span class="org-code" id="nil-1486">=foo.org=</span> was
<span class="org-code" id="nil-1500">: #+begin_src R :exports both
:   2 + 2
: #+end_src
</span>
This is a &quot;code block&quot; to be processed by Org-babel.  When Org-babel
hits such a thing, it processes it, runs R to get the results, and
stuffs the output in the LaTeX file it is creating.  The LaTeX between
code chunks is copied verbatim (except for in-line src code, about
which see below).  Hence to create a <span class="italic" id="nil-1864">/active/</span> document you just write
plain old text interspersed with &quot;code blocks&quot; which are plain old R.

<span class="org-meta-line" id="nil-1968">#+LaTeX:</span><span class="org-block" id="nil-1976"> \pagebreak</span><span class="org-block" id="nil-1987">[3</span><span class="org-block" id="nil-1989">]</span>

Plots get a little more complicated.  First we make something to plot
(simulated regression data).
<span class="org-meta-line" id="nil-2091">#+source: reg</span>
<span class="org-meta-line" id="nil-2105">#+begin_src R :results output :exports both
</span><span class="org-block" id="nil-2149">  n &lt;- 50
  x &lt;- seq(1, n)
  a.true &lt;- 3
  b.true &lt;- 1.5
  y.true &lt;- a.true + b.true </span><span class="org-block" id="nil-2234">* </span><span class="org-block" id="nil-2236">x
  s.true &lt;- 17.3
  y &lt;- y.true + s.true </span><span class="org-block" id="nil-2278">* </span><span class="org-block" id="nil-2280">rnorm(n)
  out1 &lt;- lm(y ~ x)
  summary(out1)</span><span class="org-meta-line" id="nil-2324">
#+end_src</span>
(for once we won't show the code chunk itself, look at <span class="org-code" id="nil-2390">=foo.org=</span> if
you want to see what the actual code chunk was).

Figure \ref{fig:one} (p. \pageref{fig:one}) is produced by the following code
<span class="org-meta-line" id="nil-2531">#+srcname: fig1plot</span>
<span class="org-meta-line" id="nil-2551">#+begin_src R :exports code
</span><span class="org-block" id="nil-2579">  plot(x, y)
  abline(out1)</span><span class="org-meta-line" id="nil-2606">
#+end_src</span>
Note that <span class="org-code" id="nil-2627">=x=</span>, <span class="org-code" id="nil-2632">=y=</span>, and <span class="org-code" id="nil-2641">=out1=</span> are remembered from the preceding code
chunk.  We don't have to regenerate them.  All code chunks are part of
one R &quot;session&quot;.
<span class="org-meta-line" id="nil-2775">#+source: fig1</span>
<span class="org-meta-line" id="nil-2790">#+begin_src R :exports results :noweb yes :file fig1.pdf
</span><span class="org-block" id="nil-2847">  &lt;&lt;fig1plot&gt;&gt;</span><span class="org-meta-line" id="nil-2861">
#+end_src</span>

<span class="org-meta-line" id="nil-2873">#+attr_latex: width=0.8\textwidth,placement=[p]</span>
<span class="org-meta-line" id="nil-2921">#+label: fig:one</span>
<span class="org-meta-line" id="nil-2938">#+caption: Scatter Plot with Regression Line</span>
<span class="org-meta-line" id="nil-2983">#+results: fig1</span>
<span onclick="toggle_invis('invisible-2999-3001');">…</span><span class="org-link" id="invisible-2999-3001-2999">[</span><span class="org-link" id="invisible-2999-3001-3000">[</span><span class="org-link" id="nil-3001">file:fig1.pd</span><span class="org-link" id="nil-3013">f</span><span onclick="toggle_invis('invisible-3014-3016');">…</span><span class="org-link" id="invisible-3014-3016-3014">]</span><span class="org-link" id="invisible-3014-3016-3015">]</span>

Now this was a little tricky.  We did this with two code chunks,
one visible and one invisible.  First we did
<span class="org-code" id="nil-3128">: #+srcname: fig1plot
: #+begin_src R :exports code :file fig1plot.pdf
:   plot(x, y)
:   abline(out1)
: #+end_src
</span>where the <span class="org-code" id="nil-3253">=:exports code=</span> indicates that only the return value (not
code) should be exported and the <span class="org-code" id="nil-3344">=#+srcname: fig1plot=</span> gives the code
block a name (to be used later).  And &quot;later&quot; is almost immediate.
Next we did
<span class="org-code" id="nil-3460">: #+source: fig1
: #+begin_src R :exports results :noweb yes :file fig1.pdf
:   &lt;&lt;fig1plot&gt;&gt;
: #+end_src
</span>
In this code block the <span class="org-code" id="nil-3589">=:file fig1.pdf=</span> header argumentindicates that
the block generates a figure.  Org-babel automagically makes a PDF
file for the figure, and Org-mode handles the export to LaTeX.  The
<span class="org-code" id="nil-3771">=&lt;&lt;fig1plot&gt;&gt;=</span> is an example of &quot;code block reuse&quot;.  It means that we
reuse the code of the code chunk named <span class="org-code" id="nil-3880">=fig1plot=</span>.  The <span class="org-code" id="nil-3897">=:exports
results=</span> in the code block means just what it says (we've already seen
the code---it was produced by the preceding chunk---and we don't want
to see it again, we only want to see the results).  It is important
that we observe the DRY/SPOT rule (<span class="italic" id="nil-4151">/don't repeat yourself/</span> or <span class="italic" id="nil-4178">/single
point of truth/</span>) and only have one bit of code for generating the
plot.  What the reader sees is guaranteed to be the code that made the
plot.  If we had used cut-and-paste, just repeating the code, the
duplicated code might get out of sync after edits.  The rest of this
should be recognizable to anyone who has ever done a LaTeX figure.

So making a figure is a bit more complicated in some ways, but much simpler
than others.  Note the following virtues
- The figure is guaranteed to be the one described by the text (at
  least by the R in the text).
- No messing around with sizing or rotations.  It just works!

<span class="org-meta-line" id="nil-4804">#+source: fig2</span>
<span class="org-meta-line" id="nil-4819">#+begin_src R :exports results :file fig2.pdf
</span><span class="org-block" id="nil-4865">  out3 &lt;- lm(y ~ x + I(x^2) + I(x^3))
  plot(x, y)
  curve(predict(out3, newdata=data.frame(x=x)), add = TRUE)</span><span class="org-meta-line" id="nil-4975">
#+end_src</span>

Note that if you don't care to show the R code to make the figure, it
is simpler still.  Figure \ref{fig:two} shows another plot.  What I
actually typed in <span class="org-code" id="nil-5143">=foo.org=</span> was
<span class="org-code" id="nil-5157">: #+srcname: fig2
: #+begin_src R :exports results :file fig2.pdf
:   out3 &lt;- lm(y ~ x + I(x^2) + I(x^3))
:   plot(x, y)
:   curve(predict(out3, newdata=data.frame(x=x)), add = TRUE)
: #+end_src
</span>
<span class="org-meta-line" id="nil-5353">#+attr_latex: width=0.8\textwidth,placement=[p]</span>
<span class="org-meta-line" id="nil-5401">#+label: fig:two</span>
<span class="org-meta-line" id="nil-5418">#+caption: Scatter Plot with Cubic Regression Curve</span>
<span class="org-meta-line" id="nil-5470">#+results: fig2</span>
<span onclick="toggle_invis('invisible-5486-5488');">…</span><span class="org-link" id="invisible-5486-5488-5486">[</span><span class="org-link" id="invisible-5486-5488-5487">[</span><span class="org-link" id="nil-5488">file:fig2.pd</span><span class="org-link" id="nil-5500">f</span><span onclick="toggle_invis('invisible-5501-5503');">…</span><span class="org-link" id="invisible-5501-5503-5501">]</span><span class="org-link" id="invisible-5501-5503-5502">]</span>

<span class="org-meta-line" id="nil-5505">#+LaTeX:</span><span class="org-block" id="nil-5513"> \pagebreak</span>

Now we just excluded the code for the plot from the figure (with
<span class="org-code" id="nil-5591">=:exports results=</span> so it doesn't show).

Also note that every time we re-export Figures \ref{fig:one}
and \ref{fig:two} change, the latter conspicuously (because the
simulated data are random).  Everything just works.  This should tell
you the main virtue of Org-babel.  It's always correct.  There is
never a problem with stale cut-and-paste.

<span class="org-meta-line" id="nil-5936">#+begin_src R :exports none
</span><span class="org-block" id="nil-5964">  options(scipen=10)</span><span class="org-meta-line" id="nil-5984">
#+end_src</span>

<span class="org-meta-line" id="nil-5996">#+results:</span>
<span class="org-code" id="nil-6007">: 0
</span>Simple numbers can be plugged into the text with the <span class="org-code" id="nil-6064">=src_R=</span> command,
for example, the quadratic and cubic regression coefficients in the
preceding regression were \beta_2 = src_R{round(out3$coef<span class="org-footnote" id="nil-6206">[3</span><span class="org-footnote" id="nil-6208">]</span>, 4)} and \beta_3
= src_R{round(out3$coef<span class="org-footnote" id="nil-6250">[4</span><span class="org-footnote" id="nil-6252">]</span>, 4)}.  Just magic!  What I actually typed
in <span class="org-code" id="nil-6299">=foo.org=</span> was
<span class="org-code" id="nil-6313">: were </span><span class="org-code" id="nil-6320">\beta</span><span class="org-code" id="nil-6325">_2 = src_R{round(out3$coef</span><span class="org-code" id="nil-6351">[3</span><span class="org-code" id="nil-6353">]</span><span class="org-code" id="nil-6354">, 4)}
: and </span><span class="org-code" id="nil-6366">\beta</span><span class="org-code" id="nil-6371">_3 = src_R{round(out3$coef</span><span class="org-code" id="nil-6397">[4</span><span class="org-code" id="nil-6399">]</span><span class="org-code" id="nil-6400">, 4)}
</span><span class="org-meta-line" id="nil-6406">#+begin_src R :exports none
</span><span class="org-block" id="nil-6434">  options(scipen=0)</span><span class="org-meta-line" id="nil-6453">
#+end_src</span>

The <span class="org-code" id="nil-6469">=xtable=</span> command is used to make tables.  (The following is the
Org-babel output of another code block that we don't explicitly show.
Look at <span class="org-code" id="nil-6611">=foo.org=</span> for details.)
<span class="org-meta-line" id="nil-6635">#+begin_src R :exports both :results output
</span><span class="org-block" id="nil-6679">  out2 &lt;- lm(y ~ x + I(x^2))
  foo &lt;- anova(out1, out2, out3)
  foo</span><span class="org-meta-line" id="nil-6746">
#+end_src</span>

<span class="org-meta-line" id="nil-6758">#+begin_src R :exports both :results output
</span><span class="org-block" id="nil-6802">  class(foo)</span><span class="org-meta-line" id="nil-6814">
#+end_src</span>

<span class="org-meta-line" id="nil-6826">#+begin_src R :exports both :results output
</span><span class="org-block" id="nil-6870">  dim(foo)</span><span class="org-meta-line" id="nil-6880">
#+end_src</span>

<span class="org-meta-line" id="nil-6892">#+source: foo-as-matrix</span>
<span class="org-meta-line" id="nil-6916">#+begin_src R :exports both :results output
</span><span class="org-block" id="nil-6960">  foo &lt;- as.matrix(foo)
  foo</span><span class="org-meta-line" id="nil-6989">
#+end_src</span>

<span class="org-meta-line" id="nil-7001">#+LaTeX:</span><span class="org-block" id="nil-7009"> \pagebreak</span>

<span class="org-meta-line" id="nil-7022">#+begin_src R :results output latex :exports results
</span><span class="org-block" id="nil-7075">  library(xtable)
  xtable(foo, caption = &quot;ANOVA Table&quot;, label = &quot;tab:one&quot;,
      digits = c(0, 0, 2, 0, 2, 3, 3))</span><span class="org-meta-line" id="nil-7189">
#+end_src</span>

<span class="org-meta-line" id="nil-7201">#+results: foo-as-matrix</span>

So now we are ready to turn the matrix <span class="org-code" id="nil-7266">=foo=</span> into Table \ref{tab:one}
using the R chunk
<span class="org-code" id="nil-7315">: #+begin_src R :results output latex :exports results
:   library(xtable)
:   xtable(foo, caption = &quot;ANOVA Table&quot;, label = &quot;tab:one&quot;,
:       digits = c(0, 0, 2, 0, 2, 3, 3))
: #+end_src
</span>
(note the difference between arguments to the <span class="org-code" id="nil-7550">=xtable=</span> function and to
the <span class="org-code" id="nil-7579">=xtable=</span> method of the <span class="org-code" id="nil-7602">=print=</span> function)

To summarize, Org-babel is terrific, so important that soon we'll not
be able to get along without it.  Its virtues are
- The numbers and graphics you report are actually what they
  are claimed to be.
- Your analysis is reproducible.  Even years later, when you've
  completely forgotten what you did, the whole write-up, every single
  number or pixel in a plot is reproducible.
- Your analysis actually works---at least in this particular instance.
  The code you show actually executes without error.
- Toward the end of your work, with the write-up almost done you
  discover an error.  Months of rework to do?  No!  Just fix the error
  and rerun <span class="org-code" id="nil-8275">=Sweave=</span> and <span class="org-code" id="nil-8288">=latex=</span>.  One single problem like this and
  you will have all the time invested in <span class="org-code" id="nil-8372">=Sweave=</span> repaid.
- This methodology provides dicipline.  There's nothing that will make
  you clean up your code like the prospect of actually revealing it to
  the world.

Whether we're talking about homework, a consulting report, a textbook,
or a research paper.  If they involve computing and statistics, this
is the way to do it.
</pre>

 </body>
</html>
